# 맨뒤에 삭제
katok=["다현", "정현", "쯔위", "사나", "지효", "모모"]
idx=len(katok)-1      # idx : 5
del(katok[idx])
print(katok)

# 중간데이터 삭제  - 4번지 사나
katok=["다현", "정현", "쯔위", "미나", "사나", "지효", "모모"]
katok[4]=None                 # ["다현", "정현", "쯔위", "미나", None, "지효", "모모"]
katok[4]=katok[5]             # ["다현", "정현", "쯔위", "미나", "지효", "지효", "모모"]
katok[5]=None                 # ["다현", "정현", "쯔위", "미나", "지효", None, "모모"]   
katok[5]=katok[6]             # ["다현", "정현", "쯔위", "미나", "지효", "모모", "모모"]  
katok[6]=None                 # ["다현", "정현", "쯔위", "미나", "지효", "모모", None]  
del(katok[6])
print(katok)

